
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = Данные.Наименование;
	
	Если НЕ ПустаяСтрока(Данные.ДействуетНаОсновании) Тогда
		
		Представление = СтрШаблон("%1 (на осн. %2)", Представление, Данные.ДействуетНаОсновании);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти